org/episodes.org
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 4
:PROPERTIES:
:EXPORT_FILE_NAME: episode-4
:EXPORT_DATE: 2018-09-10
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E004.mp3 :podcast_duration "10:36" :podcast_bytes "10189138"
:END:
#+begin_description
A quieter week in package updates - this week we look at some details of the 9
unique CVEs addressed across the supported Ubuntu releases and talk about
various hardening guides for Ubuntu.
#+end_description
** Overview
A quieter week in package updates - this week we look at some details of the 9
unique CVEs addressed across the supported Ubuntu releases and talk about
various hardening guides for Ubuntu.
** This week in Ubuntu Security Updates
9 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3759-1/][USN-3759-1]]] libtirpc vulnerabilities
- 3 CVEs addressed in Trusty, Xenial, Bionic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2017-8779][CVE-2017-8779]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14622][CVE-2018-14622]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2016-4429][CVE-2016-4429]]
- Transport Independent RPC Library, used by NFS
- 1 medium priority issue:
  - Crash from NULL pointer dereference when run out of file descriptions (failure to check return value) - a remote attacker could cause crash by flooding with new connections
- 2 low priority issues:
  - "rpcbomb" - allows an unauthenticated attacker to DoS via memory exhaustion
  - Stack based buffer overflow could cause a crash when flooded by ICMP and UDP packets in the sunrpc implementation - fixed by replacing stack based memory allocation with heap-based allocation instead
  - Common pattern to fix this type of issue - similar work in Linux kernel recently by KSPP to replace VLAs
*** [[[https://usn.ubuntu.com/3759-2/][USN-3759-2]]] libtirpc vulnerabilities
- 3 CVEs addressed in Precise ESM
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2017-8779][CVE-2017-8779]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14622][CVE-2018-14622]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2016-4429][CVE-2016-4429]]
- Same as above for the Precise Extended Security Maintenence release
*** [[[https://usn.ubuntu.com/3760-1/][USN-3760-1]]] transfig vulnerability
- 1 CVEs addressed in Trusty, Xenial
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16140][CVE-2018-16140]]
- transfig / fig2dev - utilities for converting XFig files
- Fixes an error which allows memory corruption when handling specially crafted files
*** [[[https://usn.ubuntu.com/3761-1/][USN-3761-1]]] Firefox vulnerabilities
- 5 CVEs addressed in Trusty, Xenial, Bionic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12383][CVE-2018-12383]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12378][CVE-2018-12378]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12377][CVE-2018-12377]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12376][CVE-2018-12376]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12375][CVE-2018-12375]]
- Latest firefox release (62) fixing a number of issues including DoS and RCE
- One interesting one is CVE-2018-12383 - in Firefox 58 the password storage
  format was changed (was sqlite, then was changed to json). When user sets a
  master password, this is used to encrypt all stored passwords. However, this
  was only done for the copy stored with the new format - the old copy would
  still be stored unencrypted since it never had a master password set on
  it. This is now fixed to simply delete the old copy of the password DB.
** Goings on in Ubuntu Security Community
*** Discussions around hardening guides for Ubuntu
- A number of 'best practices' guides exist for hardening Ubuntu installations from reputable organisations
  - [[https://www.ncsc.gov.uk/guidance/eud-security-guidance-ubuntu-1804-lts][NCSC]]
  - [[https://www.cisecurity.org/benchmark/ubuntu_linux/][CIS Benchmarks]]
  - many others
- In general these have similar recommendations:
  - Use UEFI Secure Boot
  - Disable unnecesary services
  - Use a known and fixed networking configuration (disable DHCP / use VPN etc)
  - Enable Mandatory Access Control frameworks (ie. AppArmor)
  - Use a specific password policy
  - Enable auditing
- Differ in level of detail and technical knowledge needed to deploy
- Typically aimed at computer and network administrators (not end-users)
- Ubuntu already includes a number of these recommendations out of the box:
  - https://wiki.ubuntu.com/Security/Features
- Ubuntu strives to strike a balance between security and usability out-of-the-box
*** Hiring
**** Ubuntu Security Manager
- https://boards.greenhouse.io/canonical/jobs/1278287
**** Ubuntu Security Engineer
- https://boards.greenhouse.io/canonical/jobs/1158266
** Get in contact
- [[mailto:security@ubuntu.com][security@ubuntu.com]]
- [[http://webchat.freenode.net?channels=%2523ubuntu-hardened&uio=d4][#ubuntu-hardended on the Freenode IRC network]]
- [[https://twitter.com/ubuntu_sec][@ubuntu_sec on twitter]]
